---
type: FilePath
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# FilePath

`Autodesk.Revit.DB.FilePath` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilePath | 2012 | `public FilePath ( string path )` |